Repository: sunpebble/fresh-pantry
Catalog: apps/ios/FreshPantry/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, fr, ja

# settings.reminder.daily.subtitle
source: 包含临期 + 库存不足
en: Includes expiring items + low stock
fr: Inclut les péremptions et le stock faible
ja: 期限間近と在庫不足を含みます

# settings.reminder.daily.title %@
source: 每日 %@ 汇总
en: Daily summary at %@
fr: Résumé quotidien à %@
ja: 毎日 %@ にまとめて通知

# settings.reminder.footer
source: 提醒在开启系统通知权限后送达。开启「仅每日汇总」可关闭逐条临期推送、只保留一条汇总;免打扰时段内逐条提醒不再打扰。
en: Reminders arrive once system notification permission is granted. Turn on "Daily summary only" to stop individual expiry pushes and keep just one summary; individual reminders stay quiet during quiet hours.
fr: Les rappels arrivent une fois l'autorisation de notification système accordée. Activez « Résumé quotidien uniquement » pour arrêter les notifications individuelles et ne garder qu'un résumé ; pendant les heures calmes, les rappels individuels restent silencieux.
ja: システムの通知許可をオンにするとリマインダーが届きます。「まとめて通知のみ」をオンにすると個別の期限通知を止めて、まとめ通知だけになります。おやすみ時間帯は個別通知も届きません。

# settings.reminder.header
source: 临期提醒
en: Expiry Reminders
fr: Rappels de péremption
ja: 期限リマインダー

# settings.reminderTime.subtitle
source: 临期提醒与每日汇总的送达时间
en: Delivery time for expiry reminders and the daily summary
fr: Heure d'envoi des rappels de péremption et du résumé quotidien
ja: 期限リマインダーと毎日のまとめ通知の送信時刻

# settings.reminderTime.title
source: 提醒时间
en: Reminder Time
fr: Heure du rappel
ja: 通知時刻

# settings.stats.favorites
source: 个收藏
en: favorites
fr: favoris
ja: 件のお気に入り

# settings.stats.inventory
source: 件食材
en: items
fr: ingrédients
ja: 個の食材

# settings.stats.shopping
source: 项采购
en: to buy
fr: achats
ja: 件の買い物

# settings.summaryOnly.subtitle
source: 关闭逐条临期推送 · 每天只发一条汇总
en: Turns off individual expiry pushes · one summary a day
fr: Désactive les notifications individuelles · un résumé par jour
ja: 個別の期限通知をオフ・1日1回のまとめ通知のみ

# settings.summaryOnly.title
source: 仅每日汇总
en: Daily Summary Only
fr: Résumé quotidien uniquement
ja: まとめて通知のみ

# settings.title
source: 设置
en: Settings
fr: Réglages
ja: 設定

# settings.wasteInsights.subtitle
source: 本月用掉与浪费 · 越用越省
en: This month's use and waste · save more over time
fr: Utilisation et gaspillage ce mois-ci · des économies avec le temps
ja: 今月の消費と廃棄・使うほどお得に

# settings.wasteInsights.title
source: 减废成效
en: Waste Insights
fr: Réduction du gaspillage
ja: 食品ロス実績

# share.unsupported.action
source: 知道了
en: OK
fr: OK
ja: OK

# share.unsupported.message.noURL
source: 分享内容里没有找到链接，目前仅支持「懒饭」和「下厨房」的菜谱链接。
en: No link was found in the shared content. Fresh Pantry currently supports recipe links from Lanfan and Xiachufang only.
fr: Aucun lien n'a été trouvé dans le contenu partagé. Fresh Pantry prend actuellement en charge uniquement les liens de recettes de Lanfan et Xiachufang.
ja: 共有内容にリンクが見つかりませんでした。現在は懒饭と下厨房のレシピリンクのみ対応しています。

# share.unsupported.message.unsupportedURL
source: 目前仅支持「懒饭」和「下厨房」的菜谱链接。
en: Fresh Pantry currently supports recipe links from Lanfan and Xiachufang only.
fr: Fresh Pantry prend actuellement en charge uniquement les liens de recettes de Lanfan et Xiachufang.
ja: 現在は懒饭と下厨房のレシピリンクのみ対応しています。

# share.unsupported.title
source: 无法导入
en: Cannot import
fr: Importation impossible
ja: インポートできません

# shopping.add
source: 添加
en: Add
fr: Ajouter
ja: 追加

# shopping.addIngredient
source: 添加食材
en: Add Ingredient
fr: Ajouter un ingrédient
ja: 食材を追加

# shopping.addToInventory
source: 加入库存
en: Add to Inventory
fr: Ajouter à l'inventaire
ja: 在庫に追加

# shopping.cancel
source: 取消
en: Cancel
fr: Annuler
ja: キャンセル

# shopping.category.collapseHint
source: 点按折叠分类
en: Tap to collapse category
fr: Appuyez pour réduire la catégorie
ja: タップして分類を折りたたむ

# shopping.category.expandHint
source: 点按展开分类
en: Tap to expand category
fr: Appuyez pour développer la catégorie
ja: タップして分類を展開

# shopping.category.itemCount %@ %lld
source: %@，%lld 件
en: %@, %lld items
fr: %@, %lld articles

# shopping.categoryOrder.hint
source: 拖动调整顺序,购物清单将按此顺序分组——对齐你常逛超市的货架动线。
en: Drag to reorder — the shopping list groups by this order, matching your usual store aisle route.
fr: Faites glisser pour réorganiser — la liste de courses se regroupe selon cet ordre, correspondant à votre parcours habituel en magasin.
ja: ドラッグして順序を調整すると、購入リストがこの順序でグループ化されます。よく行くスーパーの通路順に合わせられます。

# shopping.categoryOrder.title
source: 分类排序
en: Category Order
fr: Ordre des catégories
ja: 分類の並び順

# shopping.check %@
source: 勾选 %@
en: Check %@
fr: Cocher %@
ja: %@にチェック

# shopping.clear
source: 清理
en: Clear
fr: Effacer
ja: 削除

# shopping.clearChecked.confirm
source: 确定要移除所有已勾选的购物项吗？
en: Remove all checked shopping items?
fr: Supprimer tous les articles cochés de la liste de courses ?
ja: チェック済みの購入項目をすべて削除しますか？

# shopping.clearChecked.title
source: 清理已购项目
en: Clear Purchased Items
fr: Effacer les articles achetés
ja: 購入済み項目を削除

# shopping.clearDone %lld
source: 清空已完成 (%lld)
en: Clear Completed (%lld)
fr: Effacer terminés (%lld)
ja: 完了済みをクリア (%lld)

# shopping.clearFailed
source: 清理失败，请重试
en: Clear failed. Please try again.
fr: Échec de l'effacement. Veuillez réessayer.
ja: 削除に失敗しました。再試行してください

# shopping.delete
source: 删除
en: Delete
fr: Supprimer
ja: 削除

# shopping.done
source: 完成
en: Done
fr: Terminé
ja: 完了

# shopping.edit
source: 编辑
en: Edit
fr: Modifier
ja: 編集

# shopping.editQuantity
source: 编辑数量
en: Edit Quantity
fr: Modifier la quantité
ja: 数量を編集

# shopping.editQuantitySection
source: 数量
en: Quantity
fr: Quantité

# shopping.emptyMessage
source: 点右上角 + 添加需要购买的食材
en: Tap “+” at the top to add ingredients to buy
fr: Appuyez sur « + » en haut pour ajouter des ingrédients à acheter
ja: 右上の「+」で購入したい食材を追加してください

# shopping.emptyTitle
source: 购物清单为空
en: Shopping List Is Empty
fr: La liste de courses est vide
ja: 購入リストは空です

# shopping.filter.all
source: 全部
en: All
fr: Tout
ja: すべて

# shopping.filter.done
source: 已购
en: Purchased
fr: Acheté
ja: 購入済み

# shopping.filter.todo
source: 待购买
en: To Buy
fr: À acheter
ja: 購入予定

# shopping.form.addFailed
source: 添加失败，请重试
en: Add failed. Please try again.
fr: Échec de l'ajout. Veuillez réessayer.
ja: 追加に失敗しました。再試行してください

# shopping.form.categoryPicker
source: 分类
en: Category
fr: Catégorie
ja: 分類

# shopping.form.categorySection
source: 分类
en: Category
fr: Catégorie
ja: 分類

# shopping.form.detailPlaceholder
source: 数量 / 备注（选填，如 2 盒）
en: Quantity / notes (optional, e.g. 2 boxes)
fr: Quantité / notes (facultatif, ex. 2 boîtes)
ja: 数量・メモ（任意、例：2箱）

# shopping.form.duplicate %@
source: 「%@」已在购物清单中
en: “%@” is already on the shopping list
fr: « %@ » est déjà dans la liste de courses
ja: 「%@」は既に購入リストにあります

# shopping.form.namePlaceholder
source: 名称（必填）
en: Name (required)
fr: Nom (obligatoire)
ja: 名前（必須）

# shopping.form.section
source: 食材
en: Ingredient
fr: Ingrédient

# shopping.intake.applied %lld
source: 已入库 %lld 项
en: Added %lld items to inventory
fr: %lld articles ajoutés à l'inventaire
ja: %lld件を在庫に登録しました

# shopping.intake.oneClick %lld
source: 已购买的 %lld 项一键入库
en: One-Tap Add %lld Purchased Items to Inventory
fr: Ajouter en un geste %lld articles achetés à l'inventaire
ja: 購入済みの%lld件をワンタップで在庫に登録

# shopping.intake.title
source: 已购买项入库
en: Add Purchased Items to Inventory
fr: Ajouter les articles achetés à l'inventaire
ja: 購入済み項目を在庫に登録

# shopping.noDoneItems
source: 没有已购项目
en: No Purchased Items
fr: Aucun article acheté
ja: 購入済みの項目がありません

# shopping.noTodoItems
source: 没有待购项目
en: No Items to Buy
fr: Aucun article à acheter
ja: 購入予定の項目がありません

# shopping.progress.ofTotal %lld
source: / %lld 项
en: / %lld total
fr: / %lld au total
ja: / 全%lld件

# shopping.progress.title
source: 本次采购进度
en: Shopping Progress
fr: Progression des achats
ja: 今回の購入進捗

# shopping.quantityPlaceholder
source: 数量，如：2 个
en: Quantity, e.g. 2
fr: Quantité, ex. 2
ja: 数量、例：2個

# shopping.quickAdjust
source: 快速调整
en: Quick Adjust
fr: Ajustement rapide
ja: クイック調整

# shopping.readInventoryFailed
source: 读取库存失败，请重试
en: Failed to read inventory. Please try again.
fr: Échec de la lecture de l'inventaire. Veuillez réessayer.
ja: 在庫の読み込みに失敗しました。再試行してください

# shopping.save
source: 保存
en: Save
fr: Enregistrer

# shopping.saveFailedRemoved
source: 保存失败，该食材可能已被移除
en: Save failed — this ingredient may have been removed
fr: Échec de l'enregistrement — cet ingrédient a peut-être été supprimé
ja: 保存に失敗しました。この食材は削除された可能性があります

# shopping.seed.apple.name
source: 苹果
en: Apples
fr: Pommes
ja: りんご

# shopping.seed.eggs.detail
source: 1 打
en: 1 dozen
fr: 1 douzaine
ja: 1ダース

# shopping.seed.eggs.name
source: 鸡蛋
en: Eggs
fr: Œufs
ja: 卵

# shopping.seed.milk.detail
source: 2 盒
en: 2 boxes
fr: 2 boîtes
ja: 2箱

# shopping.seed.milk.name
source: 牛奶
en: Milk
fr: Lait
ja: 牛乳

# shopping.seed.pork.name
source: 猪肉
en: Pork
fr: Porc
ja: 豚肉

# shopping.seed.soySauce.detail
source: 1 瓶
en: 1 bottle
fr: 1 bouteille
ja: 1本

# shopping.seed.soySauce.name
source: 酱油
en: Soy Sauce
fr: Sauce soja
ja: 醤油

# shopping.seed.tomato.name
source: 西红柿
en: Tomatoes
fr: Tomates
ja: トマト

# shopping.title
source: 购物清单
en: Shopping List
fr: Liste de courses
ja: 購入リスト

# shopping.uncheck %@
source: 取消勾选 %@
en: Uncheck %@
fr: Décocher %@
ja: %@のチェックを外す

# shopping.undo.action
source: 撤销
en: Undo
fr: Annuler
ja: 取り消す

# shopping.undo.itemDeleted %@
source: 「%@」已删除
en: “%@” deleted
fr: « %@ » supprimé
ja: 「%@」を削除しました

# shopping.undo.itemsCleared %lld
source: 已清理 %lld 项
en: Cleared %lld items
fr: %lld articles effacés
ja: %lld件を削除しました

# shopping.undo.restoreFailed
source: 恢复失败，请重试
en: Restore failed. Please try again.
fr: Échec de la restauration. Veuillez réessayer.
ja: 復元に失敗しました。再試行してください

# spotlight.ingredient.expiresOn %@
source: %@ 到期
en: Expires %@
fr: Expire le %@
ja: %@ 期限切れ

# season.autumn
source: 秋季
en: Autumn
fr: Automne
ja: 秋

# season.spring
source: 春季
en: Spring
fr: Printemps
ja: 春

# season.summer
source: 夏季
en: Summer
fr: Été
ja: 夏

# season.winter
source: 冬季
en: Winter
fr: Hiver
ja: 冬

# storage.freezer
source: 冷冻室
en: Freezer
fr: Congélateur
ja: 冷凍室

# storage.fridge
source: 冰箱
en: Fridge
fr: Réfrigérateur
ja: 冷蔵庫

# storage.pantry
source: 食品柜
en: Pantry
fr: Placard
ja: 食品庫

# sync.action.clear
source: 清除
en: Clear
fr: Effacer
ja: 消去

# sync.action.clearFailures
source: 清除失败记录
en: Clear failed records
fr: Effacer les échecs
ja: 失敗記録を消去

# sync.action.done
source: 完成
en: Done
fr: Terminé
ja: 完了

# sync.action.retryNow
source: 立即重试
en: Retry now
fr: Réessayer maintenant
ja: 今すぐ再試行

# sync.banner.dismiss
source: 忽略
en: Dismiss
fr: Ignorer
ja: 閉じる

# sync.banner.dropped %lld
source: %lld 项更改未能保存,请重试
en: %lld changes could not be saved. Try again.
fr: %lld modifications n'ont pas pu être enregistrées. Réessayez.
ja: %lld件の変更を保存できませんでした。再試行してください。

# sync.banner.failed %lld
source: %lld 条同步失败
en: %lld sync failures
fr: %lld échecs de synchronisation
ja: %lld件の同期失敗

# sync.banner.failedPending %lld %lld
source: %lld 条同步失败 · %lld 条待同步
en: %lld sync failures · %lld pending
fr: %lld échecs · %lld en attente
ja: %lld件の同期失敗 · %lld件が保留中

# sync.banner.offline
source: 离线
en: Offline
fr: Hors ligne
ja: オフライン

# sync.banner.offlinePending %lld
source: 离线 · %lld 条待同步
en: Offline · %lld pending
fr: Hors ligne · %lld en attente
ja: オフライン · %lld件が保留中

# sync.banner.syncing %lld
source: 同步中 · %lld 条待同步
en: Syncing · %lld pending
fr: Synchronisation · %lld en attente
ja: 同期中 · %lld件が保留中

# sync.entity.customRecipe
source: 食谱
en: Recipe
fr: Recette
ja: レシピ

# sync.entity.dietaryPreference
source: 忌口
en: Dietary preference
fr: Préférence alimentaire
ja: 食事制限

# sync.entity.favoriteRecipe
source: 收藏
en: Favorite
fr: Favori
ja: お気に入り

# sync.entity.foodLogEntry
source: 食材去向
en: Food log
fr: Journal alimentaire
ja: 食材ログ

# sync.entity.householdConfig
source: 家庭设置
en: Household settings
fr: Réglages du foyer
ja: 家庭設定

# sync.entity.inventoryItem
source: 库存
en: Pantry
fr: Stock
ja: 在庫

# sync.entity.mealPlanEntry
source: 膳食计划
en: Meal plan
fr: Planning repas
ja: 献立

# sync.entity.shoppingItem
source: 购物
en: Shopping
fr: Courses
ja: 買い物

# sync.failure.clearConfirm.message %lld
source: 将丢弃 %lld 个项目的未同步更改，此操作不可撤销。
en: This will discard unsynced changes for %lld items. This cannot be undone.
fr: Les modifications non synchronisées de %lld éléments seront supprimées. Cette action est irréversible.
ja: %lld件の未同期変更を破棄します。この操作は元に戻せません。

# sync.failure.clearConfirm.title
source: 清除失败记录？
en: Clear failed records?
fr: Effacer les échecs ?
ja: 失敗記録を消去しますか？

# sync.failure.empty.message
source: 所有待同步内容已恢复正常。
en: All pending sync items are healthy again.
fr: Tous les éléments en attente de synchronisation sont à nouveau normaux.
ja: 保留中の同期項目はすべて正常に戻りました。

# sync.failure.empty.title
source: 没有同步失败项
en: No sync failures
fr: Aucun échec de synchronisation
ja: 同期失敗はありません

# sync.failure.footer
source: 这些写入多次同步失败，已暂时停止重试。可重试一次，或清除失败记录（会丢弃这些未同步的更改）。
en: These writes failed repeatedly and are paused. You can retry once or clear the failed records, which discards the unsynced changes.
fr: Ces écritures ont échoué plusieurs fois et sont suspendues. Vous pouvez réessayer une fois ou effacer les échecs, ce qui supprimera les modifications non synchronisées.
ja: これらの書き込みは繰り返し失敗したため一時停止されています。1回再試行するか、未同期の変更を破棄して失敗記録を消去できます。

# sync.failure.header
source: 同步失败的项目
en: Failed sync items
fr: Éléments en échec
ja: 同期に失敗した項目

# sync.failure.title
source: 同步失败
en: Sync failures
fr: Échecs de synchronisation
ja: 同期失敗

# sync.pending.accessibility
source: 待同步
en: Pending sync
fr: Synchronisation en attente
ja: 同期待ち

# tab.home
source: 首页
en: Home
fr: Accueil
ja: ホーム

# tab.inventory
source: 库存
en: Pantry
fr: Stock
ja: 在庫

# tab.recipes
source: 食谱
en: Recipes
fr: Recettes
ja: レシピ

# tab.settings
source: 设置
en: Settings
fr: Réglages
ja: 設定

# tab.shopping
source: 购物
en: Shopping
fr: Courses
ja: 買い物

# waste.achievement.detail.firstLocked
source: 记录第一笔吃完或扔掉
en: Log your first consumed or wasted item
fr: Enregistrez le premier aliment consommé ou jeté
ja: 最初の食べ切りまたは廃棄を記録

# waste.achievement.detail.firstUnlocked
source: 已开始记录减废
en: Waste reduction tracking has started
fr: Le suivi anti-gaspillage a commencé
ja: 減廃記録を開始しました

# waste.achievement.detail.noEnoughRecords
source: 暂无足够记录
en: Not enough records yet
fr: Pas encore assez de données
ja: まだ十分な記録がありません

# waste.achievement.detail.rescued %lld
source: 已救回 %lld 件临期食材
en: Rescued %lld expiring ingredients
fr: %lld ingrédients bientôt périmés sauvés
ja: 期限間近の食材を%lld件救済

# waste.achievement.detail.streak %lld
source: 当前连续 %lld 天零浪费
en: Current zero-waste streak: %lld days
fr: Série zéro gaspillage actuelle : %lld jours
ja: 現在%lld日連続でゼロ廃棄

# waste.achievement.detail.useUpRate %@
source: 用掉率 %@
en: Use-up rate %@
fr: Taux d'utilisation %@
ja: 使い切り率 %@

# waste.achievement.locked
source: 未解锁
en: locked
fr: verrouillé
ja: 未解除

# waste.achievement.title.firstLog
source: 减废起步
en: Waste reduction started
fr: Début anti-gaspillage
ja: 減廃スタート

# waste.achievement.title.rescue20
source: 临期救星 ×20
en: Expiry saver ×20
fr: Sauvetage ×20
ja: 期限間近レスキュー ×20

# waste.achievement.title.rescue5
source: 临期救星 ×5
en: Expiry saver ×5
fr: Sauvetage ×5
ja: 期限間近レスキュー ×5

# waste.achievement.title.streak3
source: 零浪费 3 天
en: 3 zero-waste days
fr: 3 jours zéro gaspillage
ja: ゼロ廃棄3日

# waste.achievement.title.streak7
source: 零浪费一周
en: Zero-waste week
fr: Semaine zéro gaspillage
ja: ゼロ廃棄1週間

# waste.achievement.title.useUp80
source: 八成用掉
en: 80% used
fr: 80 % utilisés
ja: 8割使い切り

# waste.achievement.unlocked
source: 已解锁
en: unlocked
fr: débloqué
ja: 解除済み

# waste.achievements
source: 减废成就
en: Achievements
fr: Succès
ja: 実績

# waste.allCategories
source: 全部分类
en: All Categories
fr: Toutes les catégories
ja: すべての分類

# waste.categoryBreakdown
source: 分类去向
en: Category Breakdown
fr: Répartition par catégorie
ja: 分類ごとの内訳

# waste.chart.category
source: 分类
en: Category
fr: Catégorie
ja: 分類

# waste.chart.outcome
source: 去向
en: Outcome
fr: Résultat

# waste.chart.quantity
source: 数量
en: Quantity
fr: Quantité

# waste.cookWithExpiring
source: 用临期食材做菜
en: Cook With Expiring Items
fr: Cuisiner avec des articles bientôt périmés
ja: 期限間近の食材で料理する

# waste.emptyMessage
source: 做菜用掉、或清理食材时选「吃完 / 扔了」,这里就会统计你的减废成效
en: Use ingredients while cooking, or choose “Consumed / Wasted” when clearing them — your waste stats will show up here
fr: Utilisez des ingrédients en cuisinant, ou choisissez « Consommé / Gaspillé » en les retirant — vos statistiques apparaîtront ici
ja: 料理で使ったり、食材を整理する際に「食べ切った／捨てた」を選ぶと、ここで減廃の成果が集計されます

# waste.emptyTitle
source: 还没有食材去向记录
en: No Departure Records Yet
fr: Pas encore d'enregistrements de sortie
ja: 食材の去向記録がまだありません

# waste.history.correctFailed
source: 修改失败，请重试
en: Correction failed. Please try again.
fr: Échec de la correction. Veuillez réessayer.
ja: 修正に失敗しました。再試行してください

# waste.history.correctTo
source: 记错了？改成
en: Logged wrong? Change to
fr: Erreur de saisie ? Changer en
ja: 記録ミス？変更する

# waste.history.emptyMessage
source: 切换上方时间范围，或先去用掉 / 清理一些食材
en: Switch the time range above, or use up / clear some ingredients first
fr: Changez la plage de temps ci-dessus, ou consommez / retirez d'abord des ingrédients
ja: 上の期間を切り替えるか、まず食材を使い切る／整理してください

# waste.history.emptyTitle
source: 这个时段还没有记录
en: No Records for This Period Yet
fr: Pas encore d'enregistrements pour cette période
ja: この期間の記録はまだありません

# waste.history.title
source: 详细记录
en: Detailed History
fr: Historique détaillé
ja: 詳細記録

# waste.itemCount %lld
source: %lld 样
en: %lld items
fr: %lld articles
ja: %lld点

# waste.metric.consumed
source: 用掉
en: Consumed
fr: Consommé
ja: 使い切った

# waste.metric.rescued
source: 抢救临期
en: Rescued
fr: Sauvé de justesse
ja: 期限間近を救済

# waste.metric.saved
source: 捐赠堆肥
en: Donated/Composted
fr: Donné/composté
ja: 寄付・堆肥化

# waste.metric.wasted
source: 浪费
en: Wasted
fr: Gaspillé
ja: 廃棄

# waste.mostWasted
source: 最常浪费
en: Most Wasted
fr: Le plus gaspillé
ja: 最もよく浪費

# waste.mostWastedHint
source: 点「最常浪费」分类可查看库存中同类食材，优先安排使用。
en: Tap a “Most Wasted” category to see similar items in your inventory and use them first.
fr: Appuyez sur une catégorie « Plus gaspillée » pour voir les articles similaires dans votre inventaire et les utiliser en priorité.
ja: 「最もよく浪費」分類をタップすると、在庫内の同種の食材を確認し、優先的に使えます。

# waste.nextStep
source: 下一步
en: Next Step
fr: Étape suivante
ja: 次のステップ

# waste.processedTotal %@ %lld
source: %@共处理 %lld 样食材
en: %@: processed %lld items
fr: %@ : %lld articles traités
ja: %@で%lld点を処理

# waste.title
source: 减废统计
en: Waste Insights
fr: Statistiques de gaspillage
ja: 食品ロス統計

# waste.useUpRate %@
source: %@用掉率
en: %@ Use-Up Rate
fr: Taux d'utilisation · %@
ja: %@の消費率

# waste.viewHistory
source: 查看详细记录
en: View Detailed History
fr: Voir l'historique détaillé
ja: 詳細記録を見る

# waste.window.last30Days
source: 近 30 天
en: Last 30 Days
fr: 30 derniers jours
ja: 過去30日間

# waste.window.last90Days
source: 近 90 天
en: Last 90 Days
fr: 90 derniers jours
ja: 過去90日間

# waste.window.thisMonth
source: 本月
en: This Month
fr: Ce mois-ci
ja: 今月

# widget.accessory.expiring %lld
source: 临期 %lld 件
en: %lld expiring
fr: %lld à surveiller
ja: 期限間近 %lld件

# widget.accessory.mealPlan %lld
source: 今日 %lld 顿
en: %lld meals today
fr: %lld repas aujourd'hui
ja: 今日 %lld食

# widget.accessory.shopping %lld
source: 待买 %lld 项
en: %lld to buy
fr: %lld à acheter
ja: 購入待ち %lld件

# widget.accessory.waste %lld
source: 用掉率 %lld%%
en: %lld%% used
fr: %lld %% utilisé
ja: 使い切り率 %lld%%

# widget.config.configurable.description
source: 一个组件切换 临期 / 今日膳食 / 购物 / 减废
en: One widget switches between expiring, meals, shopping, and waste reduction
fr: Un widget pour basculer entre péremption, repas, courses et anti-gaspillage
ja: 1つのウィジェットで期限間近・今日の食事・買い物・減廃を切り替え

# widget.config.configurable.name
source: Fresh Pantry(可配置)
en: Fresh Pantry (configurable)
fr: Fresh Pantry (configurable)
ja: Fresh Pantry(設定可能)

# widget.config.expiring.description
source: 临期 / 过期食材一览
en: Expiring and expired ingredients at a glance
fr: Aperçu des ingrédients bientôt périmés ou expirés
ja: 期限間近 / 期限切れ食材の一覧

# widget.config.expiring.name
source: 临期食材
en: Expiring ingredients
fr: Ingrédients à consommer
ja: 期限間近の食材

# widget.config.mealPlan.description
source: 今天要做的菜
en: Dishes planned for today
fr: Plats prévus aujourd'hui
ja: 今日作る料理

# widget.config.mealPlan.name
source: 今日膳食
en: Today's meals
fr: Repas du jour
ja: 今日の食事

# widget.config.shopping.description
source: 待买清单,可直接勾选
en: Shopping list with quick check-off
fr: Liste de courses à cocher directement
ja: 直接チェックできる買い物リスト

# widget.config.shopping.name
source: 购物清单
en: Shopping list
fr: Liste de courses
ja: 買い物リスト

# widget.config.waste.description
source: 用掉率与减废统计
en: Use-up rate and waste reduction stats
fr: Taux d'utilisation et stats anti-gaspillage
ja: 使い切り率と減廃統計

# widget.config.waste.name
source: 减废成效
en: Waste reduction
fr: Anti-gaspillage
ja: 減廃成效

# widget.content.type
source: 组件内容
en: Widget content
fr: Contenu du widget
ja: ウィジェット内容

# widget.expiring.allFresh
source: 都很新鲜 🎉
en: Everything is fresh 🎉
fr: Tout est frais 🎉
ja: すべて新鮮です 🎉

# widget.expiring.expired %lld
source: 已过期 %lld
en: %lld expired
fr: %lld expirés
ja: 期限切れ %lld

# widget.expiring.expiredShort
source: 已过期
en: Expired
fr: Expiré
ja: 期限切れ

# widget.expiring.noExpiry
source: 无到期
en: No expiry
fr: Pas d'expiration
ja: 期限なし

# widget.expiring.remainingDays %lld
source: 还剩 %lld 天
en: %lld days left
fr: Encore %lld jours
ja: 残り%lld日

# widget.expiring.title %lld
source: 临期 %lld 件
en: %lld need attention
fr: %lld à surveiller
ja: 要確認 %lld件

# widget.expiring.today
source: 今天到期
en: Due today
fr: Expire aujourd'hui
ja: 今日が期限

# widget.launch.openApp
source: 打开 Fresh Pantry
en: Open Fresh Pantry
fr: Ouvrir Fresh Pantry
ja: Fresh Pantryを開く

# widget.mealPlan.empty
source: 今天还没排菜
en: No meals planned today
fr: Aucun repas prévu aujourd'hui
ja: 今日はまだ献立がありません

# widget.mealPlan.pending %lld
source: %lld 顿待做
en: %lld meals pending
fr: %lld repas à préparer
ja: 未完了 %lld食

# widget.mealPlan.title
source: 今日膳食
en: Today's meals
fr: Repas du jour
ja: 今日の食事

# widget.select.description
source: 选择小组件展示的内容
en: Choose what the widget shows
fr: Choisir le contenu du widget
ja: ウィジェットに表示する内容を選択

# widget.select.parameter.content
source: 内容
en: Content
fr: Contenu

# widget.select.title
source: 选择内容
en: Choose content
fr: Choisir le contenu
ja: 内容を選択

# widget.shopping.empty
source: 清单是空的
en: List is empty
fr: La liste est vide
ja: リストは空です

# widget.shopping.title %lld
source: 购物 %lld 项待买
en: %lld shopping items
fr: %lld articles à acheter
ja: 買い物 %lld件

# widget.toggleShopping.title
source: 勾选购物项
en: Toggle shopping item
fr: Cocher un article
ja: 買い物項目を切り替え

# widget.waste.empty
source: 还没有记录
en: No records yet
fr: Aucun enregistrement
ja: 記録はまだありません

# widget.waste.summary %lld %lld
source: 抢救临期 %lld 件 · 浪费 %lld 件
en: Rescued %lld · wasted %lld
fr: %lld sauvés · %lld gaspillés
ja: 救済 %lld件 · 廃棄 %lld件

# widget.waste.title
source: 减废成效
en: Waste reduction
fr: Anti-gaspillage
ja: 減廃成效

# widget.waste.useUpRate
source: 用掉率
en: Use-up rate
fr: Taux d'utilisation
ja: 使い切り率

# widgetContent.expiring
source: 临期食材
en: Expiring ingredients
fr: Ingrédients à consommer
ja: 期限間近の食材

# widgetContent.mealPlan
source: 今日膳食
en: Today's meals
fr: Repas du jour
ja: 今日の食事

# widgetContent.shopping
source: 购物清单
en: Shopping list
fr: Liste de courses
ja: 買い物リスト

# widgetContent.waste
source: 减废成效
en: Waste reduction
fr: Anti-gaspillage
ja: 減廃成效

# shopping.seed.apple.detail
source: 6 个
ja: 6個
